tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
brew "mas"
brew "git"
brew "git-lfs"
brew "pkg-config"
brew "python"
brew "gstreamer"
brew "hugo"
brew "jpeg"
brew "mdbtools"
brew "node", link: false
cask "java"
cask "xquartz"
brew "boost"
brew "curl"
brew "openssl"
brew "freetds", args: ["with-unixodbc"]
brew "gmp"
brew "geos"
brew "libtiff"
brew "libxml2"
brew "gdal"
brew "git"
cask "gitkraken"
cask "gfortran"
brew "htop"
brew "libsndfile"
brew "libssh2"
brew "libsvg"
cask "mactex"
brew "mysql"
brew "netcdf"
brew "poppler"
brew "unixodbc"
brew "psqlodbc"
brew "python"
brew "python3"
cask "r-app"
casl "rstudio"
brew "sqliteodbc"
cask "slack"
brew "tcl-tk"
cask "toggl"
cask "calibre"
cask "docker"
cask "gimp"
cask "google-earth-pro"
cask "inkscape"
cask "mactex"
cask "mendeley"
cask "microsoft-office"
cask "skype"
cask "slack"
cask "spotify"
cask "vlc"
cask "visual-studio-code"
