tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
brew "mas"
# basic packages
brew "git"
brew "git-lfs"
brew "pkg-config"
brew "gstreamer"
cask "xquartz"
brew "htop"
brew "openssl"
brew 'grep'
# libreries for packages and miscelaneous
brew "jpeg"
brew "mdbtools"
cask "java"
brew "boost"
brew "curl"
brew "cairo"
brew "openssl"
brew "freetds", args: ["with-unixodbc"]
brew "gmp"
brew "geos"
brew "graphviz", args: ["with-librsvg", "with-x11"]
brew "imagemagick", args: ["with-fftw", "with-librsvg", "with-x11"]
brew "libtiff"
brew "libxml2"
brew "gdal"
brew "git"
brew "libsndfile"
brew "libssh2"
brew "libjpeg"
brew "libsvg"
brew "mysql"
brew "netcdf"
brew "poppler"
brew "unixodbc"
brew "psqlodbc"
brew "sqliteodbc"
brew "tcl-tk"
brew "qt"
brew "webp"
brew "zmq"
brew 'libpng'
# data science
cask "r-app"
cask "rstudio"
cask "gfortran"
brew "python"
# other commonly used software
cask "slack"
cask "toggl"
cask "calibre"
cask "docker"
cask "gimp"
cask "google-earth-pro"
cask "inkscape"
cask "mactex"
cask "mendeley"
cask "microsoft-office"
cask "skype"
cask "slack"
cask "spotify"
cask "dropbox"
cask "vlc"
cask "visual-studio-code"
cask "gitkraken"
brew 'zstd'
brew 'unrar'
brew 'pandoc' 
brew 'pandoc-citeproc'
brew 'pandoc-crossref'
brew 'node'
cask 'docker-toolbox'
cask 'bitwarden'
